Revit 2027 API
IFCCategoryTemplate.ResetCategoryToDefault Method
 Reset one category, sub-category, or special category in the current mapping table to the default values defined in Revit
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportIFCCategoryInfo ResetCategoryToDefault(
	ExportIFCCategoryKey categoryKey
)
Public Function ResetCategoryToDefault (
	categoryKey As ExportIFCCategoryKey
) As ExportIFCCategoryInfo
public:
ExportIFCCategoryInfo^ ResetCategoryToDefault(
	ExportIFCCategoryKey^ categoryKey
)
member ResetCategoryToDefault :
        categoryKey : ExportIFCCategoryKey -> ExportIFCCategoryInfo
Parameters
categoryKey ExportIFCCategoryKey
 The selected category information.
Return Value
ExportIFCCategoryInfo
 The default information.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCCategoryTemplate Class
Autodesk.Revit.DB Namespace